_NUMBER_CN2AN = '零〇,一壹幺,二贰两俩,三叁仨,四肆,五伍,六陆,七柒,八捌,九玖'.split(',')
NUMBER_CN2AN = {c: i for i, s in enumerate(_NUMBER_CN2AN) for c in s}

UNIT_CN2AN = {
    "十": 10,
    "拾": 10,
    "百": 100,
    "佰": 100,
    "千": 1000,
    "仟": 1000,
    "万": 10000,
    "亿": 100000000,
}

UNIT_LOW_AN2CN = {
    10: "十",
    100: "百",
    1000: "千",
    10000: "万",
    100000000: "亿",
}

NUMBER_LOW = '零一二三四五六七八九'
NUMBER_UP = '零壹贰叁肆伍陆柒捌玖'

NUMBER_LOW_AN2CN = dict(enumerate(NUMBER_LOW))
NUMBER_UP_AN2CN = dict(enumerate(NUMBER_UP))

UNIT_LOW_ORDER_AN2CN = ',十,百,千,万,十,百,千,亿,十,百,千,万,十,百,千'.split(',')
UNIT_UP_ORDER_AN2CN = ',拾,佰,仟,万,拾,佰,仟,亿,拾,佰,仟,万,拾,佰,仟'.split(',')

STRICT_CN_NUMBER = {
    "零": "零",
    "一": "一壹",
    "二": "二贰",
    "三": "三叁",
    "四": "四肆",
    "五": "五伍",
    "六": "六陆",
    "七": "七柒",
    "八": "八捌",
    "九": "九玖",
    "十": "十拾",
    "百": "百佰",
    "千": "千仟",
    "万": "万",
    "亿": "亿",
}
NORMAL_CN_NUMBER = {
    "零": "零〇",
    "一": "一壹幺",
    "二": "二贰两",
    "三": "三叁仨",
    "四": "四肆",
    "五": "五伍",
    "六": "六陆",
    "七": "七柒",
    "八": "八捌",
    "九": "九玖",
    "十": "十拾",
    "百": "百佰",
    "千": "千仟",
    "万": "万",
    "亿": "亿",
}
